import streamlit as st 

# ส่วนหัวข้อเว็บ(Header)
st.title("ยินดีต้อนรับสู่โปรไฟล์ของฉัน✨")
st.write("นี่คือเว็ยแอปพลิเคชันแรกในชีวิตของดิฉัน เขียนด้วยภาษา Python ค่ะ")

st.divider()# เส้นคั่นแบ่งสัดส่วนให้สวยงาม

#ส่วนข้อมูลส่วนตัว(Profile Info)
st.header(ข้อมูลส่วนตัว")
st.write("**ชื่อ-นามสกุล** นางสาว กชพร เดชะ")
st.write("**ชั้นม.4/4**เลขที่16")
st.write("โรงเรียน** ยุพราชวิทยาลัย**)

# ส่วนปุ่มกดแสดงความรู้สึก
if st.button("คลิกบอกความรู้สึกกับการเขียนเว็บครั้งแรก"):
    st.success(f"ว้าว! สนุกและง่ายกว่าที่คิดมาก ๆ!")
